#ALL QUESTIONS AND QUIZES THERE

all_quizes = [
        ('Математика', ),
        ('Вопросы из кто хочет стать миллионером(на 3 миллиона рублей)', ),
        ('Самый умный', ), ]

math_questions = [
        ('Сколько будет 2 в -1 степени?', '0,5', '0,2', '2', '-2'),
        ('Имя ученого который придумал нахождение гипотенузы по катетам?', 'Пифагор', 'Аристотель', 'Сократ', 'Паскаль'),
        ('Формула площади ромба равна', 'Половине произведения диагоналей', 'Произведению 2ух сторон', 'Половине произведения высоты на сторону', 'Произведению диагоналей'),
        ('Вектор это - ', 'Направленный отрезок прямой', 'Луч на плоскости', 'Формула для нахождения точки пересечния парабол', 'Усовершенствованный треугольник Паскаля'),
        ("Кто изобрел знак равенства '='?", 'Роберт Рекорд', 'Энштейн', 'Архимед', 'Блез Паскаль'),
        ('Кто является отцом математики?', 'Архимед', 'Блез Паскаль', 'Пифагор', 'Геродот'),
        ('Среднее арифметическое значение первых 50 натуральных чисел?', '25.5', '25.555555', '25', '50'),
        ('Значение Пи равно - ', '3.14159', '3.14152', '3.14525252', '3.14195'),
        ('Кто является отцом алгебры?', 'Мухаммад ибн Муса аль-Хорезми', 'Архимед', 'Мухаммад Мусли ибл аль-Кингим', 'Пифагор'),
        ('Сколько ребер у октаэдра?', '12', '6', '10', '8'),
        ('Какую форму имеют сотовые ячейки?', 'Шестиугольник', 'Пентагон', 'Восьмиугольники', 'Квадрат'),
        ('next_quiz', 'next_quiz')]

millionare_questions = [
        ('Сколько раз в сутки подзаводят куранты Спасской башни Кремля?', 'Два', 'Три', 'Один', 'Четыре'),
        ('Кто 1-м получил Нобелевскую премию по литературе?', 'Поэт', 'Романтист', 'Драматург', 'Эссеист'),
        ('Что запрещал указ, который в 1726 году подписала Екатерина I?', 'Пускать пыль в глаза', 'Бить баклуши', 'Точить лясы', 'Переливать из пустого в порожнее'),
        ('Какая фигура завершает партию в комбинации, которую шахматисты называют «мат Легаля»?', 'Конь', 'Слон', 'Король', 'Ладья'),
        ('Что Шекспир назвал «вкуснейшим из блюд в земном пиру»?', 'Сон', 'Опьянение', 'Любовь', 'Уединение'),
        ('next_quiz', 'next_quiz')]

riddle_questions = [
        ('Когда сетью можно вытянуть воду?', 'Когда вода замерзла', 'Когда нет рыбы', 'Когда уплыла золотая рыбка', 'Когда сеть порвалась'),
        ('Что не поместится даже в самую большую кастрюлю во вселенной?', 'Ее крышка', 'Планета', 'Кастрюля супа', '100000 грузовиков'),
        ('Что больше слона и ничего не весит?', 'Тень слона', 'Воздушный шар', 'Парашют', 'Облако'),
        ('next_quiz', 'next_quiz')]



math_questions1 = [
        ('Сколько будет 2 в -1 степени?', '0,5', '0,2', '2', '-2'),
        ('Имя ученого который придумал нахождение гипотенузы по катетам?', 'Пифагор', 'Аристотель', 'Сократ', 'Паскаль'),
        ('Формула площади ромба равна', 'Половине произведения диагоналей', 'Произведению 2ух сторон', 'Половине произведения высоты на сторону', 'Произведению диагоналей'),
        ('Вектор это - ', 'Направленный отрезок прямой', 'Луч на плоскости', 'Формула для нахождения точки пересечния парабол', 'Усовершенствованный треугольник Паскаля'),
        ("Кто изобрел знак равенства '='?", 'Роберт Рекорд', 'Энштейн', 'Архимед', 'Блез Паскаль'),
        ('Кто является отцом математики?', 'Архимед', 'Блез Паскаль', 'Пифагор', 'Геродот'),
        ('Среднее арифметическое значение первых 50 натуральных чисел?', '25.5', '25.555555', '25', '50'),
        ('Значение Пи равно - ', '3.14159', '3.14152', '3.14525252', '3.14195'),
        ('Кто является отцом алгебры?', 'Мухаммад ибн Муса аль-Хорезми', 'Архимед', 'Мухаммад Мусли ибл аль-Кингим', 'Пифагор'),
        ('Сколько ребер у октаэдра?', '12', '6', '10', '8'),
        ('Какую форму имеют сотовые ячейки?', 'Шестиугольник', 'Пентагон', 'Восьмиугольники', 'Квадрат')]

millionare_questions1 = [
        ('Сколько раз в сутки подзаводят куранты Спасской башни Кремля?', 'Два', 'Три', 'Один', 'Четыре'),
        ('Кто 1-м получил Нобелевскую премию по литературе?', 'Поэт', 'Романтист', 'Драматург', 'Эссеист'),
        ('Что запрещал указ, который в 1726 году подписала Екатерина I?', 'Пускать пыль в глаза', 'Бить баклуши', 'Точить лясы', 'Переливать из пустого в порожнее'),
        ('Какая фигура завершает партию в комбинации, которую шахматисты называют «мат Легаля»?', 'Конь', 'Слон', 'Король', 'Ладья'),
        ('Что Шекспир назвал «вкуснейшим из блюд в земном пиру»?', 'Сон', 'Опьянение', 'Любовь', 'Уединение')]

riddle_questions1 = [
        ('Когда сетью можно вытянуть воду?', 'Когда вода замерзла', 'Когда нет рыбы', 'Когда уплыла золотая рыбка', 'Когда сеть порвалась'),
        ('Что не поместится даже в самую большую кастрюлю во вселенной?', 'Ее крышка', 'Планета', 'Кастрюля супа', '100000 грузовиков'),
        ('Что больше слона и ничего не весит?', 'Тень слона', 'Воздушный шар', 'Парашют', 'Облако')]


all_questions = math_questions1 + millionare_questions1 + riddle_questions1
list_questions_QuizContent = math_questions + millionare_questions + riddle_questions