#ALL QUESTIONS AND QUIZES THERE

all_quizes = [
        ('Математика', ),
        ('Вопросы из кто хочет стать миллионером(на 3 миллиона рублей)', ),
        ('Самый умный', ),
        ('Вопросы о кс:го', ), ]

math_questions = [
        ('Сколько будет 2 в -1 степени?', '0,5', '0,2', '2', '-2'),
        ('Имя ученого который придумал нахождение гипотенузы по катетам?', 'Пифагор', 'Аристотель', 'Сократ', 'Паскаль'),
        ('Формула площади ромба равна', 'Половине произведения диагоналей', 'Произведению 2ух сторон', 'Половине произведения высоты на сторону', 'Произведению диагоналей'),
        ('Вектор это - ', 'Направленный отрезок прямой', 'Луч на плоскости', 'Формула для нахождения точки пересечния парабол', 'Усовершенствованный треугольник Паскаля'),
        ("Кто изобрел знак равенства '='?", 'Роберт Рекорд', 'Энштейн', 'Архимед', 'Блез Паскаль'),
        ('Кто является отцом математики?', 'Архимед', 'Блез Паскаль', 'Пифагор', 'Геродот'),
        ('Среднее арифметическое значение первых 50 натуральных чисел?', '25.5', '25.555555', '25', '50'),
        ('Значение Пи равно - ', '3.14159', '3.14152', '3.14525252', '3.14195'),
        ('Кто является отцом алгебры?', 'Мухаммад ибн Муса аль-Хорезми', 'Архимед', 'Мухаммад Мусли ибл аль-Кингим', 'Пифагор'),
        ('Сколько ребер у октаэдра?', '12', '6', '10', '8'),
        ('Какую форму имеют сотовые ячейки?', 'Шестиугольник', 'Пентагон', 'Восьмиугольники', 'Квадрат'),
        ('next_quiz', 'next_quiz')]

millionare_questions = [
        ('Сколько раз в сутки подзаводят куранты Спасской башни Кремля?', 'Два', 'Три', 'Один', 'Четыре'),
        ('Кто 1-м получил Нобелевскую премию по литературе?', 'Поэт', 'Романтист', 'Драматург', 'Эссеист'),
        ('Что запрещал указ, который в 1726 году подписала Екатерина I?', 'Пускать пыль в глаза', 'Бить баклуши', 'Точить лясы', 'Переливать из пустого в порожнее'),
        ('Какая фигура завершает партию в комбинации, которую шахматисты называют «мат Легаля»?', 'Конь', 'Слон', 'Король', 'Ладья'),
        ('Что Шекспир назвал «вкуснейшим из блюд в земном пиру»?', 'Сон', 'Опьянение', 'Любовь', 'Уединение'),
        ('next_quiz', 'next_quiz')]

riddle_questions = [
        ('Когда сетью можно вытянуть воду?', 'Когда вода замерзла', 'Когда нет рыбы', 'Когда уплыла золотая рыбка', 'Когда сеть порвалась'),
        ('Что не поместится даже в самую большую кастрюлю во вселенной?', 'Ее крышка', 'Планета', 'Кастрюля супа', '100000 грузовиков'),
        ('Что больше слона и ничего не весит?', 'Тень слона', 'Воздушный шар', 'Парашют', 'Облако'),
        ('next_quiz', 'next_quiz')]

cybersport_questions = [
        ('MVP IEM Katowice 2019 (Major)', 'Magisk', 'S1mple', 'ZywOo', 'KennyS'),
        ('Сколько стоит AK-47?', '2700$', '2750$', '2900$', '3100$'),
        ('Сколько званий в CS:GO?', '18', '20', '16', '19'),
        ('Когда вышла CS:GO?', '21.08.2012', '01.01.2010', '05.03.2004', '14.09.2012'),
        ('Какой tickrate на официальных серверах Valve в cs:go?', '64', '128', '32', '96'),
        ('Какое оружие недоступно для контр-террористов?', 'Tec-9', 'mp9', 'usp-s', 'm4a1-s'),
        ('Сколько денег дают за убийство с ножа?', '1500$', '2000$', '800$', '1000$'),
        ('Какое оружие недоступно для террористов?', 'Famas', 'Mac-10', 'Galil Ar', 'Tec-9'),
        ('Какое действие НЕ слышат окружающие игроки?', 'Смена оружия в руках', 'Перезарядка', 'Переключения зума', 'Прыжок'),
        ('Какой урон наносит AK-47 в голову без шлема?', '143', '107', '96', '99'),
        ('Сколько держится дымовая граната?', '18 секунд', '14 секунд', '15 секунд', '20 секунд'),
        ('Сколько максимум денег может быть у игрока в напарниках?', '8000$', '10000$', '16000$', '6000$'),
        ('На сколько дефуза сокращают время разминирования?', '5 секунд', '4 секунды', '7 секунды', '3 секунды'),
        ('Сколько времени длится раунд в мм?', '1мин 55сек', '1мин 45сек', '2 минуты', '1мин 30сек'),
        ('Сколько стоит набор сапёра в CS:GO?', '400$', '500$', '300$', '800$'),
        ('next_quiz', 'next_quiz')]



math_questions1 = [
        ('Сколько будет 2 в -1 степени?', '0,5', '0,2', '2', '-2'),
        ('Имя ученого который придумал нахождение гипотенузы по катетам?', 'Пифагор', 'Аристотель', 'Сократ', 'Паскаль'),
        ('Формула площади ромба равна', 'Половине произведения диагоналей', 'Произведению 2ух сторон', 'Половине произведения высоты на сторону', 'Произведению диагоналей'),
        ('Вектор это - ', 'Направленный отрезок прямой', 'Луч на плоскости', 'Формула для нахождения точки пересечния парабол', 'Усовершенствованный треугольник Паскаля'),
        ("Кто изобрел знак равенства '='?", 'Роберт Рекорд', 'Энштейн', 'Архимед', 'Блез Паскаль'),
        ('Кто является отцом математики?', 'Архимед', 'Блез Паскаль', 'Пифагор', 'Геродот'),
        ('Среднее арифметическое значение первых 50 натуральных чисел?', '25.5', '25.555555', '25', '50'),
        ('Значение Пи равно - ', '3.14159', '3.14152', '3.14525252', '3.14195'),
        ('Кто является отцом алгебры?', 'Мухаммад ибн Муса аль-Хорезми', 'Архимед', 'Мухаммад Мусли ибл аль-Кингим', 'Пифагор'),
        ('Сколько ребер у октаэдра?', '12', '6', '10', '8'),
        ('Какую форму имеют сотовые ячейки?', 'Шестиугольник', 'Пентагон', 'Восьмиугольники', 'Квадрат')]

millionare_questions1 = [
        ('Сколько раз в сутки подзаводят куранты Спасской башни Кремля?', 'Два', 'Три', 'Один', 'Четыре'),
        ('Кто 1-м получил Нобелевскую премию по литературе?', 'Поэт', 'Романтист', 'Драматург', 'Эссеист'),
        ('Что запрещал указ, который в 1726 году подписала Екатерина I?', 'Пускать пыль в глаза', 'Бить баклуши', 'Точить лясы', 'Переливать из пустого в порожнее'),
        ('Какая фигура завершает партию в комбинации, которую шахматисты называют «мат Легаля»?', 'Конь', 'Слон', 'Король', 'Ладья'),
        ('Что Шекспир назвал «вкуснейшим из блюд в земном пиру»?', 'Сон', 'Опьянение', 'Любовь', 'Уединение')]

riddle_questions1 = [
        ('Когда сетью можно вытянуть воду?', 'Когда вода замерзла', 'Когда нет рыбы', 'Когда уплыла золотая рыбка', 'Когда сеть порвалась'),
        ('Что не поместится даже в самую большую кастрюлю во вселенной?', 'Ее крышка', 'Планета', 'Кастрюля супа', '100000 грузовиков'),
        ('Что больше слона и ничего не весит?', 'Тень слона', 'Воздушный шар', 'Парашют', 'Облако')]

cybersport_questions1 = [
        ('MVP IEM Katowice 2019 (Major)', 'Magisk', 'S1mple', 'ZywOo', 'KennyS'),
        ('Сколько стоит AK-47?', '2700$', '2750$', '2900$', '3100$'),
        ('Сколько званий в CS:GO?', '18', '20', '16', '19'),
        ('Когда вышла CS:GO?', '21.08.2012', '01.01.2010', '05.03.2004', '14.09.2012'),
        ('Какой tickrate на официальных серверах Valve в cs:go?', '64', '128', '32', '96'),
        ('Какое оружие недоступно для контр-террористов?', 'Tec-9', 'mp9', 'usp-s', 'm4a1-s'),
        ('Сколько денег дают за убийство с ножа?', '1500$', '2000$', '800$', '1000$'),
        ('Какое оружие недоступно для террористов?', 'Famas', 'Mac-10', 'Galil Ar', 'Tec-9'),
        ('Какое действие НЕ слышат окружающие игроки?', 'Смена оружия в руках', 'Перезарядка', 'Переключения зума', 'Прыжок'),
        ('Какой урон наносит AK-47 в голову без шлема?', '143', '107', '96', '99'),
        ('Сколько держится дымовая граната?', '18 секунд', '14 секунд', '15 секунд', '20 секунд'),
        ('Сколько максимум денег может быть у игрока в напарниках?', '8000$', '10000$', '16000$', '6000$'),
        ('На сколько дефуза сокращают время разминирования?', '5 секунд', '4 секунды', '7 секунды', '3 секунды'),
        ('Сколько времени длится раунд в мм?', '1мин 55сек', '1мин 45сек', '2 минуты', '1мин 30сек'),
        ('Сколько стоит набор сапёра в CS:GO?', '400$', '500$', '300$', '800$')
]



all_questions = math_questions1 + millionare_questions1 + riddle_questions1 + cybersport_questions1
list_questions_QuizContent = math_questions + millionare_questions + riddle_questions + cybersport_questions